app/controllers/customer/sessions_controller.rb

    def create
      @form = Customer::LoginForm.new(params[:customer_login_form])
      if @form.email.present?
        customer = Customer.find_by(email_for_index:@form.email.downcase)
---
SELECT  `customers`.* FROM `customers`  WHERE `customers`.`email_for_index` = 'sato@example.com' LIMIT 1