app/controllers/admin/staff_members_controller.rb

  def create
    @staff_member = StaffMember.new(staff_member_params)
    if @staff_member.save
---
INSERT INTO `staff_members` (`created_at`, `email`, `email_for_index`, `family_name`, `family_name_kana`, `given_name`, `given_name_kana`, `hashed_password`, `start_date`, `updated_at`) VALUES ('2016-09-27 10:44:48', 'member1@example.com', 'member1@example.com', '山田', 'ヤマダ', '太郎', 'タロウ', '$2a$10$fIZ6x0uaHBarFw476YsFzOcuMKmx6zeY8ONakee7z7NH69U8ls0u.', '2016-09-26', '2016-09-27 10:44:48')

  def update
    @staff_member = StaffMember.find(params[:id])
    @staff_member.assign_attributes(staff_member_params)
    if @staff_member.save
---
SELECT  `staff_members`.* FROM `staff_members`  WHERE `staff_members`.`id` = 2 LIMIT 1
UPDATE `staff_members` SET `email` = 'member2@example.com', `email_for_index` = 'member2@example.com', `hashed_password` = '$2a$10$F1b1YqiuvhjAf2N8tIBBiuhATI5XyOWI/LNy0bQlLO.e9zjkpOTe2', `suspended` = 1, `updated_at` = '2016-09-27 10:44:48' WHERE `staff_members`.`id` = 2