app/controllers/staff/accounts_controller.rb

  def update
    @staff_member = current_staff_member
    @staff_member.assign_attributes(staff_member_params)
    if params[:commit]
      if @staff_member.save
---
UPDATE `staff_members` SET `email` = 'test@example.com', `email_for_index` = 'test@example.com', `updated_at` = '2016-09-27 10:44:49' WHERE `staff_members`.`id` = 4