app/controllers/staff/customers_controller.rb

SELECT  `customers`.* FROM `customers`  WHERE `customers`.`id` = 1 LIMIT 1
---
  def show
    @customer = Customer.find(params[:id])